# main.py: Основной файл скрипта, который запускает бота. Этот файл содержит блок if __name__ == '__main__':, который инициализирует и запускает процесс торговли.
#
# robot.py: Файл, содержащий класс TradingBot, который управляет основной логикой работы бота.
#
# config.py: Файл для хранения конфигурационных данных, таких как параметры подключения к торговой платформе, настройки стратегии и прочие переменные окружения.
#
# terminal.py: Класс Terminal, отвечающий за управление соединением с торговым терминалом.
#
# candle.py: Класс Candle, описывающий структуру и методы работы с данными свечей.
#
# order_block.py: Класс OrderBlock, отвечающий за управление торговыми блоками и выполнение соответствующих операций.
#
# requirements.txt: Список зависимостей Python, необходимых для работы проекта. Обычно включает библиотеки, такие как numpy, MetaTrader5 и другие.